zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/LPC5534/iar/startup_LPC5534.s
; -------------------------------------------------------------------------
;  @file:    startup_LPC5534.s
;  @purpose: CMSIS Cortex-M33 Core Device Startup File
;            LPC5534
;  @version: 2.0
;  @date:    2024-10-29
;  @build:   b250520
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2025 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

__iar_init$$done:              ; The vector table is not needed
                      ; until after copy initialization is done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     SecureFault_Handler                           ;Secure Fault Handler
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     0                                             ;Reserved
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     WDT_BOD_IRQHandler                            ;Windowed watchdog timer, Brownout detect, Flash interrupt
        DCD     DMA0_IRQHandler                               ;DMA0 controller
        DCD     GINT0_IRQHandler                              ;GPIO group 0
        DCD     GINT1_IRQHandler                              ;GPIO group 1
        DCD     PIN_INT0_IRQHandler                           ;Pin interrupt 0 or pattern match engine slice 0
        DCD     PIN_INT1_IRQHandler                           ;Pin interrupt 1or pattern match engine slice 1
        DCD     PIN_INT2_IRQHandler                           ;Pin interrupt 2 or pattern match engine slice 2
        DCD     PIN_INT3_IRQHandler                           ;Pin interrupt 3 or pattern match engine slice 3
        DCD     UTICK0_IRQHandler                             ;Micro-tick Timer
        DCD     MRT0_IRQHandler                               ;Multi-rate timer
        DCD     CTIMER0_IRQHandler                            ;Standard counter/timer CTIMER0
        DCD     CTIMER1_IRQHandler                            ;Standard counter/timer CTIMER1
        DCD     SCT0_IRQHandler                               ;SCTimer/PWM
        DCD     CTIMER3_IRQHandler                            ;Standard counter/timer CTIMER3
        DCD     FLEXCOMM0_IRQHandler                          ;Flexcomm Interface 0 (USART, SPI, I2C, I2S, FLEXCOMM)
        DCD     FLEXCOMM1_IRQHandler                          ;Flexcomm Interface 1 (USART, SPI, I2C, I2S, FLEXCOMM)
        DCD     FLEXCOMM2_IRQHandler                          ;Flexcomm Interface 2 (USART, SPI, I2C, I2S, FLEXCOMM)
        DCD     FLEXCOMM3_IRQHandler                          ;Flexcomm Interface 3 (USART, SPI, I2C, I2S, FLEXCOMM)
        DCD     FLEXCOMM4_IRQHandler                          ;Flexcomm Interface 4 (USART, SPI, I2C, I2S, FLEXCOMM)
        DCD     FLEXCOMM5_IRQHandler                          ;Flexcomm Interface 5 (USART, SPI, I2C, I2S, FLEXCOMM)
        DCD     FLEXCOMM6_IRQHandler                          ;Flexcomm Interface 6 (USART, SPI, I2C, I2S, FLEXCOMM)
        DCD     FLEXCOMM7_IRQHandler                          ;Flexcomm Interface 7 (USART, SPI, I2C, I2S, FLEXCOMM)
        DCD     ADC0_IRQHandler                               ;ADC0
        DCD     ADC1_IRQHandler                               ;ADC1
        DCD     ACMP_IRQHandler                               ;ACMP interrupts
        DCD     DMIC_IRQHandler                               ;Digital microphone and DMIC subsystem
        DCD     HWVAD0_IRQHandler                             ;Hardware Voice Activity Detector
        DCD     USB0_NEEDCLK_IRQHandler                       ;USB Activity Wake-up Interrupt
        DCD     USB0_IRQHandler                               ;USB device
        DCD     RTC_IRQHandler                                ;RTC alarm and wake-up interrupts
        DCD     EZH_ARCH_B0_IRQHandler                        ;EZH interrupt
        DCD     WAKEUP_IRQHandler                             ;Wakeup interrupt
        DCD     PIN_INT4_IRQHandler                           ;Pin interrupt 4 or pattern match engine slice 4 int
        DCD     PIN_INT5_IRQHandler                           ;Pin interrupt 5 or pattern match engine slice 5 int
        DCD     PIN_INT6_IRQHandler                           ;Pin interrupt 6 or pattern match engine slice 6 int
        DCD     PIN_INT7_IRQHandler                           ;Pin interrupt 7 or pattern match engine slice 7 int
        DCD     CTIMER2_IRQHandler                            ;Standard counter/timer CTIMER2
        DCD     CTIMER4_IRQHandler                            ;Standard counter/timer CTIMER4
        DCD     OS_EVENT_IRQHandler                           ;OS_EVENT_TIMER and OS_EVENT_WAKEUP interrupts
        DCD     FlexSPI0_IRQHandler                           ;FlexSPI interrupt
        DCD     Reserved56_IRQHandler                         ;Reserved interrupt
        DCD     Reserved57_IRQHandler                         ;Reserved interrupt
        DCD     Reserved58_IRQHandler                         ;Reserved interrupt
        DCD     CAN0_IRQ0_IRQHandler                          ;CAN0 interrupt0
        DCD     CAN0_IRQ1_IRQHandler                          ;CAN0 interrupt1
        DCD     Reserved61_IRQHandler                         ;Reserved interrupt
        DCD     Reserved62_IRQHandler                         ;Reserved interrupt
        DCD     Reserved63_IRQHandler                         ;Reserved interrupt
        DCD     Reserved64_IRQHandler                         ;Reserved interrupt
        DCD     SEC_HYPERVISOR_CALL_IRQHandler                ;SEC_HYPERVISOR_CALL interrupt
        DCD     SEC_GPIO_INT0_IRQ0_IRQHandler                 ;SEC_GPIO_INT00 interrupt
        DCD     SEC_GPIO_INT0_IRQ1_IRQHandler                 ;SEC_GPIO_INT01 interrupt
        DCD     Freqme_IRQHandler                             ;frequency measure interrupt
        DCD     SEC_VIO_IRQHandler                            ;SEC_VIO interrupt
        DCD     ELS_IRQHandler                                ;ELS and ELS error interrupts
        DCD     PKC_IRQHandler                                ;Public Key Cryptography interrupt
        DCD     Reserved72_IRQHandler                         ;Reserved interrupt
        DCD     POWERQUAD_IRQHandler                          ;PowerQuad interrupt
        DCD     DMA1_IRQHandler                               ;DMA1 interrupt
        DCD     FLEXCOMM8_IRQHandler                          ;LSPI_HS interrupt
        DCD     CDOG_IRQHandler                               ;CodeWDG interrupt
        DCD     Reserved77_IRQHandler                         ;Reserved interrupt
        DCD     I3C0_IRQHandler                               ;I3C interrupt
        DCD     Reserved79_IRQHandler                         ;Reserved interrupt
        DCD     Reserved80_IRQHandler                         ;Reserved interrupt
        DCD     ELS_IRQ1_IRQHandler                           ;ELS_IRQ1
        DCD     Tamper_IRQHandler                             ;Tamper
        DCD     Reserved83_IRQHandler                         ;Reserved interrupt
        DCD     Reserved84_IRQHandler                         ;Reserved interrupt
        DCD     Reserved85_IRQHandler                         ;Reserved interrupt
        DCD     Reserved86_IRQHandler                         ;Reserved interrupt
        DCD     Reserved87_IRQHandler                         ;Reserved interrupt
        DCD     Reserved88_IRQHandler                         ;Reserved interrupt
        DCD     Reserved89_IRQHandler                         ;Reserved interrupt
        DCD     DAC0_IRQHandler                               ;dac0 interrupt
        DCD     DAC1_IRQHandler                               ;dac1 interrupt
        DCD     DAC2_IRQHandler                               ;dac2 interrupt
        DCD     HSCMP0_IRQHandler                             ;hscmp0 interrupt
        DCD     HSCMP1_IRQHandler                             ;hscmp1 interrupt
        DCD     HSCMP2_IRQHandler                             ;hscmp2 interrupt
        DCD     FLEXPWM0_CAPTURE_IRQHandler                   ;flexpwm0_capture interrupt
        DCD     FLEXPWM0_FAULT_IRQHandler                     ;flexpwm0_fault interrupt
        DCD     FLEXPWM0_RELOAD_ERROR_IRQHandler              ;flexpwm0_reload_error interrupt
        DCD     FLEXPWM0_COMPARE0_IRQHandler                  ;flexpwm0_compare0 interrupt
        DCD     FLEXPWM0_RELOAD0_IRQHandler                   ;flexpwm0_reload0 interrupt
        DCD     FLEXPWM0_COMPARE1_IRQHandler                  ;flexpwm0_compare1 interrupt
        DCD     FLEXPWM0_RELOAD1_IRQHandler                   ;flexpwm0_reload1 interrupt
        DCD     FLEXPWM0_COMPARE2_IRQHandler                  ;flexpwm0_compare2 interrupt
        DCD     FLEXPWM0_RELOAD2_IRQHandler                   ;flexpwm0_reload2 interrupt
        DCD     FLEXPWM0_COMPARE3_IRQHandler                  ;flexpwm0_compare3 interrupt
        DCD     FLEXPWM0_RELOAD3_IRQHandler                   ;flexpwm0_reload3 interrupt
        DCD     FLEXPWM1_CAPTURE_IRQHandler                   ;flexpwm1_capture interrupt
        DCD     FLEXPWM1_FAULT_IRQHandler                     ;flexpwm1_fault interrupt
        DCD     FLEXPWM1_RELOAD_ERROR_IRQHandler              ;flexpwm1_reload_error interrupt
        DCD     FLEXPWM1_COMPARE0_IRQHandler                  ;flexpwm1_compare0 interrupt
        DCD     FLEXPWM1_RELOAD0_IRQHandler                   ;flexpwm1_reload0 interrupt
        DCD     FLEXPWM1_COMPARE1_IRQHandler                  ;flexpwm1_compare1 interrupt
        DCD     FLEXPWM1_RELOAD1_IRQHandler                   ;flexpwm1_reload1 interrupt
        DCD     FLEXPWM1_COMPARE2_IRQHandler                  ;flexpwm1_compare2 interrupt
        DCD     FLEXPWM1_RELOAD2_IRQHandler                   ;flexpwm1_reload2 interrupt
        DCD     FLEXPWM1_COMPARE3_IRQHandler                  ;flexpwm1_compare3 interrupt
        DCD     FLEXPWM1_RELOAD3_IRQHandler                   ;flexpwm1_reload3 interrupt
        DCD     ENC0_COMPARE_IRQHandler                       ;enc0_compare interrupt
        DCD     ENC0_HOME_IRQHandler                          ;enc0_home interrupt
        DCD     ENC0_WDG_IRQHandler                           ;enc0_wdg interrupt
        DCD     ENC0_IDX_IRQHandler                           ;enc0_idx interrupt
        DCD     ENC1_COMPARE_IRQHandler                       ;enc1_compare interrupt
        DCD     ENC1_HOME_IRQHandler                          ;enc1_home interrupt
        DCD     ENC1_WDG_IRQHandler                           ;enc1_wdg interrupt
        DCD     ENC1_IDX_IRQHandler                           ;enc1_idx interrupt
        DCD     Reserved126_IRQHandler                        ;Reserved interrupt
        DCD     Reserved127_IRQHandler                        ;Reserved interrupt
        DCD     ELS_ERR_IRQHandler                            ;ELS error interrupt
        DCD     PKC_ERR_IRQHandler                            ;PKC error interrupt
        DCD     Reserved130_IRQHandler                        ;Reserved interrupt
        DCD     Reserved131_IRQHandler                        ;Reserved interrupt
        DCD     Reserved132_IRQHandler                        ;Reserved interrupt
        DCD     Reserved133_IRQHandler                        ;Reserved interrupt
        DCD     FLASH_IRQHandler                              ;flash interrupt
        DCD     RAM_PARITY_ECC_ERR_IRQHandler                 ;ram_parity_ecc_err interrupt
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        CPSID   I               ; Mask interrupts
        LDR     R0, =0xE000ED08
        LDR     R1, =__vector_table
        STR     R1, [R0]
        LDR     R2, [R1]
        MSR     MSP, R2
        LDR     R0, =sfb(CSTACK)
        MSR     MSPLIM, R0
        CPSIE   I               ; Unmask interrupts
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

